SolderedElectronics/Dasduino-Board-Definitions-for-Arduino-IDE/Dasduino_ESP8266_core-1.0.0/boards.txt
#
# Do not create pull-requests for this file only, CI will not accept them.
# You *must* edit/modify/run boards.txt.py to regenerate boards.txt.
# All modified files after running with option "--allgen" must be included in the pull-request.
#

menu.BoardModel=Model
menu.ESPModule=Module
menu.UploadTool=Upload Tool
menu.baud=Upload Speed
menu.xtal=CPU Frequency
menu.CrystalFreq=Crystal Frequency
menu.eesz=Flash Size
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.ResetMethod=Reset Method
menu.dbg=Debug port
menu.lvl=Debug Level
menu.ip=lwIP Variant
menu.vt=VTables
menu.exception=C++ Exceptions
menu.stacksmash=Stack Protection
menu.wipe=Erase Flash
menu.sdk=Espressif FW
menu.ssl=SSL Support
menu.mmu=MMU
menu.non32xfer=Non-32-Bit Access

##############################################################
connect.name=Dasduino Connect (ESP8266)
connect.build.board=ESP8266_GENERIC
connect.upload.tool=esptool
connect.upload.maximum_data_size=81920
connect.upload.wait_for_upload_port=true
connect.upload.erase_cmd=
connect.serial.disableDTR=true
connect.serial.disableRTS=true
connect.build.mcu=esp8266
connect.build.core=esp8266
connect.build.variant=generic
connect.build.spiffs_pagesize=256
connect.build.debug_port=
connect.build.debug_level=
connect.menu.xtal.80=80 MHz
connect.menu.xtal.80.build.f_cpu=80000000L
connect.menu.xtal.160=160 MHz
connect.menu.xtal.160.build.f_cpu=160000000L
connect.menu.vt.flash=Flash
connect.menu.vt.flash.build.vtable_flags=-DVTABLES_IN_FLASH
connect.menu.vt.heap=Heap
connect.menu.vt.heap.build.vtable_flags=-DVTABLES_IN_DRAM
connect.menu.vt.iram=IRAM
connect.menu.vt.iram.build.vtable_flags=-DVTABLES_IN_IRAM
connect.menu.exception.disabled=Disabled (new aborts on oom)
connect.menu.exception.disabled.build.exception_flags=-fno-exceptions
connect.menu.exception.disabled.build.stdcpp_lib=-lstdc++
connect.menu.exception.enabled=Enabled
connect.menu.exception.enabled.build.exception_flags=-fexceptions
connect.menu.exception.enabled.build.stdcpp_lib=-lstdc++-exc
connect.menu.stacksmash.disabled=Disabled
connect.menu.stacksmash.disabled.build.stacksmash_flags=
connect.menu.stacksmash.enabled=Enabled
connect.menu.stacksmash.enabled.build.stacksmash_flags=-fstack-protector
connect.menu.ssl.all=All SSL ciphers (most compatible)
connect.menu.ssl.all.build.sslflags=
connect.menu.ssl.basic=Basic SSL ciphers (lower ROM use)
connect.menu.ssl.basic.build.sslflags=-DBEARSSL_SSL_BASIC
connect.menu.mmu.3232=32KB cache + 32KB IRAM (balanced)
connect.menu.mmu.3232.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
connect.menu.mmu.4816=16KB cache + 48KB IRAM (IRAM)
connect.menu.mmu.4816.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000
connect.menu.mmu.4816H=16KB cache + 48KB IRAM and 2nd Heap (shared)
connect.menu.mmu.4816H.build.mmuflags=-DMMU_IRAM_SIZE=0xC000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_IRAM_HEAP
connect.menu.mmu.3216=16KB cache + 32KB IRAM + 16KB 2nd Heap (not shared)
connect.menu.mmu.3216.build.mmuflags=-DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x4000 -DMMU_SEC_HEAP=0x40108000 -DMMU_SEC_HEAP_SIZE=0x4000
connect.menu.mmu.ext128k=128K External 23LC1024
connect.menu.mmu.ext128k.build.mmuflags=-DMMU_EXTERNAL_HEAP=128 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
connect.menu.mmu.ext1024k=1M External 64 MBit PSRAM
connect.menu.mmu.ext1024k.build.mmuflags=-DMMU_EXTERNAL_HEAP=256 -DMMU_IRAM_SIZE=0x8000 -DMMU_ICACHE_SIZE=0x8000
connect.menu.non32xfer.fast=Use pgm_read macros for IRAM/PROGMEM
connect.menu.non32xfer.fast.build.non32xferflags=
connect.menu.non32xfer.safe=Byte/Word access to IRAM/PROGMEM (very slow)
connect.menu.non32xfer.safe.build.non32xferflags=-DNON32XFER_HANDLER
connect.menu.ResetMethod.nodemcu=dtr (aka nodemcu)
connect.menu.ResetMethod.nodemcu.upload.resetmethod=--before default_reset --after hard_reset
connect.menu.ResetMethod.ck=no dtr (aka ck)
connect.menu.ResetMethod.ck.upload.resetmethod=--before no_reset --after soft_reset
connect.menu.ResetMethod.nodtr_nosync=no dtr, no_sync
connect.menu.ResetMethod.nodtr_nosync.upload.resetmethod=--before no_reset_no_sync --after soft_reset
connect.menu.CrystalFreq.26=26 MHz
connect.menu.CrystalFreq.40=40 MHz
connect.menu.CrystalFreq.40.build.extra_flags=-DF_CRYSTAL=40000000 -DESP8266
connect.menu.FlashFreq.40=40MHz
connect.menu.FlashFreq.40.build.flash_freq=40
connect.menu.FlashFreq.80=80MHz
connect.menu.FlashFreq.80.build.flash_freq=80
connect.menu.FlashFreq.20=20MHz
connect.menu.FlashFreq.20.build.flash_freq=20
connect.menu.FlashFreq.26=26MHz
connect.menu.FlashFreq.26.build.flash_freq=26
connect.menu.FlashMode.qio=QIO (fast)
connect.menu.FlashMode.qio.build.flash_mode=qio
connect.menu.FlashMode.qio.build.flash_flags=-DFLASHMODE_QIO
connect.menu.FlashMode.dout=DOUT (compatible)
connect.menu.FlashMode.dout.build.flash_mode=dout
connect.menu.FlashMode.dout.build.flash_flags=-DFLASHMODE_DOUT
connect.menu.FlashMode.dio=DIO
connect.menu.FlashMode.dio.build.flash_mode=dio
connect.menu.FlashMode.dio.build.flash_flags=-DFLASHMODE_DIO
connect.menu.FlashMode.qout=QOUT
connect.menu.FlashMode.qout.build.flash_mode=qout
connect.menu.FlashMode.qout.build.flash_flags=-DFLASHMODE_QOUT
connect.menu.eesz.1M64=1MB (FS:64KB OTA:~470KB)
connect.menu.eesz.1M64.build.flash_size=1M
connect.menu.eesz.1M64.build.flash_size_bytes=0x100000
connect.menu.eesz.1M64.build.flash_ld=eagle.flash.1m64.ld
connect.menu.eesz.1M64.build.spiffs_pagesize=256
connect.menu.eesz.1M64.upload.maximum_size=958448
connect.menu.eesz.1M64.build.rfcal_addr=0xFC000
connect.menu.eesz.1M64.build.spiffs_start=0xEB000
connect.menu.eesz.1M64.build.spiffs_end=0xFB000
connect.menu.eesz.1M64.build.spiffs_blocksize=4096
connect.menu.eesz.1M128=1MB (FS:128KB OTA:~438KB)
connect.menu.eesz.1M128.build.flash_size=1M
connect.menu.eesz.1M128.build.flash_size_bytes=0x100000
connect.menu.eesz.1M128.build.flash_ld=eagle.flash.1m128.ld
connect.menu.eesz.1M128.build.spiffs_pagesize=256
connect.menu.eesz.1M128.upload.maximum_size=892912
connect.menu.eesz.1M128.build.rfcal_addr=0xFC000
connect.menu.eesz.1M128.build.spiffs_start=0xDB000
connect.menu.eesz.1M128.build.spiffs_end=0xFB000
connect.menu.eesz.1M128.build.spiffs_blocksize=4096
connect.menu.eesz.1M144=1MB (FS:144KB OTA:~430KB)
connect.menu.eesz.1M144.build.flash_size=1M
connect.menu.eesz.1M144.build.flash_size_bytes=0x100000
connect.menu.eesz.1M144.build.flash_ld=eagle.flash.1m144.ld
connect.menu.eesz.1M144.build.spiffs_pagesize=256
connect.menu.eesz.1M144.upload.maximum_size=876528
connect.menu.eesz.1M144.build.rfcal_addr=0xFC000
connect.menu.eesz.1M144.build.spiffs_start=0xD7000
connect.menu.eesz.1M144.build.spiffs_end=0xFB000
connect.menu.eesz.1M144.build.spiffs_blocksize=4096
connect.menu.eesz.1M160=1MB (FS:160KB OTA:~422KB)
connect.menu.eesz.1M160.build.flash_size=1M
connect.menu.eesz.1M160.build.flash_size_bytes=0x100000
connect.menu.eesz.1M160.build.flash_ld=eagle.flash.1m160.ld
connect.menu.eesz.1M160.build.spiffs_pagesize=256
connect.menu.eesz.1M160.upload.maximum_size=860144
connect.menu.eesz.1M160.build.rfcal_addr=0xFC000
connect.menu.eesz.1M160.build.spiffs_start=0xD3000
connect.menu.eesz.1M160.build.spiffs_end=0xFB000
connect.menu.eesz.1M160.build.spiffs_blocksize=4096
connect.menu.eesz.1M192=1MB (FS:192KB OTA:~406KB)
connect.menu.eesz.1M192.build.flash_size=1M
connect.menu.eesz.1M192.build.flash_size_bytes=0x100000
connect.menu.eesz.1M192.build.flash_ld=eagle.flash.1m192.ld
connect.menu.eesz.1M192.build.spiffs_pagesize=256
connect.menu.eesz.1M192.upload.maximum_size=827376
connect.menu.eesz.1M192.build.rfcal_addr=0xFC000
connect.menu.eesz.1M192.build.spiffs_start=0xCB000
connect.menu.eesz.1M192.build.spiffs_end=0xFB000
connect.menu.eesz.1M192.build.spiffs_blocksize=4096
connect.menu.eesz.1M256=1MB (FS:256KB OTA:~374KB)
connect.menu.eesz.1M256.build.flash_size=1M
connect.menu.eesz.1M256.build.flash_size_bytes=0x100000
connect.menu.eesz.1M256.build.flash_ld=eagle.flash.1m256.ld
connect.menu.eesz.1M256.build.spiffs_pagesize=256
connect.menu.eesz.1M256.upload.maximum_size=761840
connect.menu.eesz.1M256.build.rfcal_addr=0xFC000
connect.menu.eesz.1M256.build.spiffs_start=0xBB000
connect.menu.eesz.1M256.build.spiffs_end=0xFB000
connect.menu.eesz.1M256.build.spiffs_blocksize=4096
connect.menu.eesz.1M512=1MB (FS:512KB OTA:~246KB)
connect.menu.eesz.1M512.build.flash_size=1M
connect.menu.eesz.1M512.build.flash_size_bytes=0x100000
connect.menu.eesz.1M512.build.flash_ld=eagle.flash.1m512.ld
connect.menu.eesz.1M512.build.spiffs_pagesize=256
connect.menu.eesz.1M512.upload.maximum_size=499696
connect.menu.eesz.1M512.build.rfcal_addr=0xFC000
connect.menu.eesz.1M512.build.spiffs_start=0x7B000
connect.menu.eesz.1M512.build.spiffs_end=0xFB000
connect.menu.eesz.1M512.build.spiffs_blocksize=8192
connect.menu.eesz.1M=1MB (FS:none OTA:~502KB)
connect.menu.eesz.1M.build.flash_size=1M
connect.menu.eesz.1M.build.flash_size_bytes=0x100000
connect.menu.eesz.1M.build.flash_ld=eagle.flash.1m.ld
connect.menu.eesz.1M.build.spiffs_pagesize=256
connect.menu.eesz.1M.upload.maximum_size=1023984
connect.menu.eesz.1M.build.rfcal_addr=0xFC000
connect.menu.eesz.2M64=2MB (FS:64KB OTA:~992KB)
connect.menu.eesz.2M64.build.flash_size=2M
connect.menu.eesz.2M64.build.flash_size_bytes=0x200000
connect.menu.eesz.2M64.build.flash_ld=eagle.flash.2m64.ld
connect.menu.eesz.2M64.build.spiffs_pagesize=256
connect.menu.eesz.2M64.upload.maximum_size=1044464
connect.menu.eesz.2M64.build.rfcal_addr=0x1FC000
connect.menu.eesz.2M64.build.spiffs_start=0x1F0000
connect.menu.eesz.2M64.build.spiffs_end=0x1FB000
connect.menu.eesz.2M64.build.spiffs_blocksize=4096
connect.menu.eesz.2M128=2MB (FS:128KB OTA:~960KB)
connect.menu.eesz.2M128.build.flash_size=2M
connect.menu.eesz.2M128.build.flash_size_bytes=0x200000
connect.menu.eesz.2M128.build.flash_ld=eagle.flash.2m128.ld
connect.menu.eesz.2M128.build.spiffs_pagesize=256
connect.menu.eesz.2M128.upload.maximum_size=1044464
connect.menu.eesz.2M128.build.rfcal_addr=0x1FC000
connect.menu.eesz.2M128.build.spiffs_start=0x1E0000
connect.menu.eesz.2M128.build.spiffs_end=0x1FB000
connect.menu.eesz.2M128.build.spiffs_blocksize=4096
connect.menu.eesz.2M256=2MB (FS:256KB OTA:~896KB)
connect.menu.eesz.2M256.build.flash_size=2M
connect.menu.eesz.2M256.build.flash_size_bytes=0x200000
connect.menu.eesz.2M256.build.flash_ld=eagle.flash.2m256.ld
connect.menu.eesz.2M256.build.spiffs_pagesize=256
connect.menu.eesz.2M256.upload.maximum_size=1044464
connect.menu.eesz.2M256.build.rfcal_addr=0x1FC000
connect.menu.eesz.2M256.build.spiffs_start=0x1C0000
connect.menu.eesz.2M256.build.spiffs_end=0x1FB000
connect.menu.eesz.2M256.build.spiffs_blocksize=4096
connect.menu.eesz.2M512=2MB (FS:512KB OTA:~768KB)
connect.menu.eesz.2M512.build.flash_size=2M
connect.menu.eesz.2M512.build.flash_size_bytes=0x200000
connect.menu.eesz.2M512.build.flash_ld=eagle.flash.2m512.ld
connect.menu.eesz.2M512.build.spiffs_pagesize=256
connect.menu.eesz.2M512.upload.maximum_size=1044464
connect.menu.eesz.2M512.build.rfcal_addr=0x1FC000
connect.menu.eesz.2M512.build.spiffs_start=0x180000
connect.menu.eesz.2M512.build.spiffs_end=0x1FA000
connect.menu.eesz.2M512.build.spiffs_blocksize=8192
connect.menu.eesz.2M1M=2MB (FS:1MB OTA:~512KB)
connect.menu.eesz.2M1M.build.flash_size=2M
connect.menu.eesz.2M1M.build.flash_size_bytes=0x200000
connect.menu.eesz.2M1M.build.flash_ld=eagle.flash.2m1m.ld
connect.menu.eesz.2M1M.build.spiffs_pagesize=256
connect.menu.eesz.2M1M.upload.maximum_size=1044464
connect.menu.eesz.2M1M.build.rfcal_addr=0x1FC000
connect.menu.eesz.2M1M.build.spiffs_start=0x100000
connect.menu.eesz.2M1M.build.spiffs_end=0x1FA000
connect.menu.eesz.2M1M.build.spiffs_blocksize=8192
connect.menu.eesz.2M=2MB (FS:none OTA:~1019KB)
connect.menu.eesz.2M.build.flash_size=2M
connect.menu.eesz.2M.build.flash_size_bytes=0x200000
connect.menu.eesz.2M.build.flash_ld=eagle.flash.2m.ld
connect.menu.eesz.2M.build.spiffs_pagesize=256
connect.menu.eesz.2M.upload.maximum_size=1044464
connect.menu.eesz.2M.build.rfcal_addr=0x1FC000
connect.menu.eesz.4M2M=4MB (FS:2MB OTA:~1019KB)
connect.menu.eesz.4M2M.build.flash_size=4M
connect.menu.eesz.4M2M.build.flash_size_bytes=0x400000
connect.menu.eesz.4M2M.build.flash_ld=eagle.flash.4m2m.ld
connect.menu.eesz.4M2M.build.spiffs_pagesize=256
connect.menu.eesz.4M2M.upload.maximum_size=1044464
connect.menu.eesz.4M2M.build.rfcal_addr=0x3FC000
connect.menu.eesz.4M2M.build.spiffs_start=0x200000
connect.menu.eesz.4M2M.build.spiffs_end=0x3FA000
connect.menu.eesz.4M2M.build.spiffs_blocksize=8192
connect.menu.eesz.4M3M=4MB (FS:3MB OTA:~512KB)
connect.menu.eesz.4M3M.build.flash_size=4M
connect.menu.eesz.4M3M.build.flash_size_bytes=0x400000
connect.menu.eesz.4M3M.build.flash_ld=eagle.flash.4m3m.ld
connect.menu.eesz.4M3M.build.spiffs_pagesize=256
connect.menu.eesz.4M3M.upload.maximum_size=1044464
connect.menu.eesz.4M3M.build.rfcal_addr=0x3FC000
connect.menu.eesz.4M3M.build.spiffs_start=0x100000
connect.menu.eesz.4M3M.build.spiffs_end=0x3FA000
connect.menu.eesz.4M3M.build.spiffs_blocksize=8192
connect.menu.eesz.4M1M=4MB (FS:1MB OTA:~1019KB)
connect.menu.eesz.4M1M.build.flash_size=4M
connect.menu.eesz.4M1M.build.flash_size_bytes=0x400000
connect.menu.eesz.4M1M.build.flash_ld=eagle.flash.4m1m.ld
connect.menu.eesz.4M1M.build.spiffs_pagesize=256
connect.menu.eesz.4M1M.upload.maximum_size=1044464
connect.menu.eesz.4M1M.build.rfcal_addr=0x3FC000
connect.menu.eesz.4M1M.build.spiffs_start=0x300000
connect.menu.eesz.4M1M.build.spiffs_end=0x3FA000
connect.menu.eesz.4M1M.build.spiffs_blocksize=8192
connect.menu.eesz.4M=4MB (FS:none OTA:~1019KB)
connect.menu.eesz.4M.build.flash_size=4M
connect.menu.eesz.4M.build.flash_size_bytes=0x400000
connect.menu.eesz.4M.build.flash_ld=eagle.flash.4m.ld
connect.menu.eesz.4M.build.spiffs_pagesize=256
connect.menu.eesz.4M.upload.maximum_size=1044464
connect.menu.eesz.4M.build.rfcal_addr=0x3FC000
connect.menu.eesz.8M6M=8MB (FS:6MB OTA:~1019KB)
connect.menu.eesz.8M6M.build.flash_size=8M
connect.menu.eesz.8M6M.build.flash_size_bytes=0x800000
connect.menu.eesz.8M6M.build.flash_ld=eagle.flash.8m6m.ld
connect.menu.eesz.8M6M.build.spiffs_pagesize=256
connect.menu.eesz.8M6M.upload.maximum_size=1044464
connect.menu.eesz.8M6M.build.rfcal_addr=0x7FC000
connect.menu.eesz.8M6M.build.spiffs_start=0x200000
connect.menu.eesz.8M6M.build.spiffs_end=0x7FA000
connect.menu.eesz.8M6M.build.spiffs_blocksize=8192
connect.menu.eesz.8M7M=8MB (FS:7MB OTA:~512KB)
connect.menu.eesz.8M7M.build.flash_size=8M
connect.menu.eesz.8M7M.build.flash_size_bytes=0x800000
connect.menu.eesz.8M7M.build.flash_ld=eagle.flash.8m7m.ld
connect.menu.eesz.8M7M.build.spiffs_pagesize=256
connect.menu.eesz.8M7M.upload.maximum_size=1044464
connect.menu.eesz.8M7M.build.rfcal_addr=0x7FC000
connect.menu.eesz.8M7M.build.spiffs_start=0x100000
connect.menu.eesz.8M7M.build.spiffs_end=0x7FA000
connect.menu.eesz.8M7M.build.spiffs_blocksize=8192
connect.menu.eesz.16M14M=16MB (FS:14MB OTA:~1019KB)
connect.menu.eesz.16M14M.build.flash_size=16M
connect.menu.eesz.16M14M.build.flash_size_bytes=0x1000000
connect.menu.eesz.16M14M.build.flash_ld=eagle.flash.16m14m.ld
connect.menu.eesz.16M14M.build.spiffs_pagesize=256
connect.menu.eesz.16M14M.upload.maximum_size=1044464
connect.menu.eesz.16M14M.build.rfcal_addr=0xFFC000
connect.menu.eesz.16M14M.build.spiffs_start=0x200000
connect.menu.eesz.16M14M.build.spiffs_end=0xFFA000
connect.menu.eesz.16M14M.build.spiffs_blocksize=8192
connect.menu.eesz.16M15M=16MB (FS:15MB OTA:~512KB)
connect.menu.eesz.16M15M.build.flash_size=16M
connect.menu.eesz.16M15M.build.flash_size_bytes=0x1000000
connect.menu.eesz.16M15M.build.flash_ld=eagle.flash.16m15m.ld
connect.menu.eesz.16M15M.build.spiffs_pagesize=256
connect.menu.eesz.16M15M.upload.maximum_size=1044464
connect.menu.eesz.16M15M.build.rfcal_addr=0xFFC000
connect.menu.eesz.16M15M.build.spiffs_start=0x100000
connect.menu.eesz.16M15M.build.spiffs_end=0xFFA000
connect.menu.eesz.16M15M.build.spiffs_blocksize=8192
connect.menu.eesz.512K32=512KB (FS:32KB OTA:~230KB)
connect.menu.eesz.512K32.build.flash_size=512K
connect.menu.eesz.512K32.build.flash_size_bytes=0x80000
connect.menu.eesz.512K32.build.flash_ld=eagle.flash.512k32.ld
connect.menu.eesz.512K32.build.spiffs_pagesize=256
connect.menu.eesz.512K32.upload.maximum_size=466928
connect.menu.eesz.512K32.build.rfcal_addr=0x7C000
connect.menu.eesz.512K32.build.spiffs_start=0x73000
connect.menu.eesz.512K32.build.spiffs_end=0x7B000
connect.menu.eesz.512K32.build.spiffs_blocksize=4096
connect.menu.eesz.512K64=512KB (FS:64KB OTA:~214KB)
connect.menu.eesz.512K64.build.flash_size=512K
connect.menu.eesz.512K64.build.flash_size_bytes=0x80000
connect.menu.eesz.512K64.build.flash_ld=eagle.flash.512k64.ld
connect.menu.eesz.512K64.build.spiffs_pagesize=256
connect.menu.eesz.512K64.upload.maximum_size=434160
connect.menu.eesz.512K64.build.rfcal_addr=0x7C000
connect.menu.eesz.512K64.build.spiffs_start=0x6B000
connect.menu.eesz.512K64.build.spiffs_end=0x7B000
connect.menu.eesz.512K64.build.spiffs_blocksize=4096
connect.menu.eesz.512K128=512KB (FS:128KB OTA:~182KB)
connect.menu.eesz.512K128.build.flash_size=512K
connect.menu.eesz.512K128.build.flash_size_bytes=0x80000
connect.menu.eesz.512K128.build.flash_ld=eagle.flash.512k128.ld
connect.menu.eesz.512K128.build.spiffs_pagesize=256
connect.menu.eesz.512K128.upload.maximum_size=368624
connect.menu.eesz.512K128.build.rfcal_addr=0x7C000
connect.menu.eesz.512K128.build.spiffs_start=0x5B000
connect.menu.eesz.512K128.build.spiffs_end=0x7B000
connect.menu.eesz.512K128.build.spiffs_blocksize=4096
connect.menu.eesz.512K=512KB (FS:none OTA:~246KB)
connect.menu.eesz.512K.build.flash_size=512K
connect.menu.eesz.512K.build.flash_size_bytes=0x80000
connect.menu.eesz.512K.build.flash_ld=eagle.flash.512k.ld
connect.menu.eesz.512K.build.spiffs_pagesize=256
connect.menu.eesz.512K.upload.maximum_size=499696
connect.menu.eesz.512K.build.rfcal_addr=0x7C000
connect.menu.sdk.nonosdk_190703=nonos-sdk 2.2.1+100 (190703)
connect.menu.sdk.nonosdk_190703.build.sdk=NONOSDK22x_190703
