SolderedElectronics/Dasduino-Board-Definitions-for-Arduino-IDE/Dasduino_ESP8266_core-1.0.0/boards.txt
connect.menu.sdk.nonosdk_191122=nonos-sdk 2.2.1+119 (191122)
connect.menu.sdk.nonosdk_191122.build.sdk=NONOSDK22x_191122
connect.menu.sdk.nonosdk_191105=nonos-sdk 2.2.1+113 (191105)
connect.menu.sdk.nonosdk_191105.build.sdk=NONOSDK22x_191105
connect.menu.sdk.nonosdk_191024=nonos-sdk 2.2.1+111 (191024)
connect.menu.sdk.nonosdk_191024.build.sdk=NONOSDK22x_191024
connect.menu.sdk.nonosdk221=nonos-sdk 2.2.1 (legacy)
connect.menu.sdk.nonosdk221.build.sdk=NONOSDK221
connect.menu.sdk.nonosdk3v0=nonos-sdk pre-3 (180626 known issues)
connect.menu.sdk.nonosdk3v0.build.sdk=NONOSDK3V0
connect.menu.ip.lm2f=v2 Lower Memory
connect.menu.ip.lm2f.build.lwip_include=lwip2/include
connect.menu.ip.lm2f.build.lwip_lib=-llwip2-536-feat
connect.menu.ip.lm2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
connect.menu.ip.hb2f=v2 Higher Bandwidth
connect.menu.ip.hb2f.build.lwip_include=lwip2/include
connect.menu.ip.hb2f.build.lwip_lib=-llwip2-1460-feat
connect.menu.ip.hb2f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=0
connect.menu.ip.lm2n=v2 Lower Memory (no features)
connect.menu.ip.lm2n.build.lwip_include=lwip2/include
connect.menu.ip.lm2n.build.lwip_lib=-llwip2-536
connect.menu.ip.lm2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
connect.menu.ip.hb2n=v2 Higher Bandwidth (no features)
connect.menu.ip.hb2n.build.lwip_include=lwip2/include
connect.menu.ip.hb2n.build.lwip_lib=-llwip2-1460
connect.menu.ip.hb2n.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=0 -DLWIP_IPV6=0
connect.menu.ip.lm6f=v2 IPv6 Lower Memory
connect.menu.ip.lm6f.build.lwip_include=lwip2/include
connect.menu.ip.lm6f.build.lwip_lib=-llwip6-536-feat
connect.menu.ip.lm6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
connect.menu.ip.hb6f=v2 IPv6 Higher Bandwidth
connect.menu.ip.hb6f.build.lwip_include=lwip2/include
connect.menu.ip.hb6f.build.lwip_lib=-llwip6-1460-feat
connect.menu.ip.hb6f.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460 -DLWIP_FEATURES=1 -DLWIP_IPV6=1
connect.menu.dbg.Disabled=Disabled
connect.menu.dbg.Disabled.build.debug_port=
connect.menu.dbg.Serial=Serial
connect.menu.dbg.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
connect.menu.dbg.Serial1=Serial1
connect.menu.dbg.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
connect.menu.lvl.None____=None
connect.menu.lvl.None____.build.debug_level=
connect.menu.lvl.SSL=SSL
connect.menu.lvl.SSL.build.debug_level= -DDEBUG_ESP_SSL
connect.menu.lvl.TLS_MEM=TLS_MEM
connect.menu.lvl.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
connect.menu.lvl.HTTP_CLIENT=HTTP_CLIENT
connect.menu.lvl.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
connect.menu.lvl.HTTP_SERVER=HTTP_SERVER
connect.menu.lvl.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
connect.menu.lvl.SSLTLS_MEM=SSL+TLS_MEM
connect.menu.lvl.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
connect.menu.lvl.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
connect.menu.lvl.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
connect.menu.lvl.SSLHTTP_SERVER=SSL+HTTP_SERVER
connect.menu.lvl.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
connect.menu.lvl.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
connect.menu.lvl.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
connect.menu.lvl.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
connect.menu.lvl.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
connect.menu.lvl.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
connect.menu.lvl.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
connect.menu.lvl.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
connect.menu.lvl.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
connect.menu.lvl.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
connect.menu.lvl.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
connect.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
connect.menu.lvl.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
connect.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
connect.menu.lvl.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
connect.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
connect.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
connect.menu.lvl.CORE=CORE
connect.menu.lvl.CORE.build.debug_level= -DDEBUG_ESP_CORE
connect.menu.lvl.WIFI=WIFI
connect.menu.lvl.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
connect.menu.lvl.HTTP_UPDATE=HTTP_UPDATE
connect.menu.lvl.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
connect.menu.lvl.UPDATER=UPDATER
connect.menu.lvl.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
connect.menu.lvl.OTA=OTA
connect.menu.lvl.OTA.build.debug_level= -DDEBUG_ESP_OTA
connect.menu.lvl.OOM=OOM
connect.menu.lvl.OOM.build.debug_level= -DDEBUG_ESP_OOM
connect.menu.lvl.MDNS=MDNS
connect.menu.lvl.MDNS.build.debug_level= -DDEBUG_ESP_MDNS
connect.menu.lvl.HWDT=HWDT
connect.menu.lvl.HWDT.build.debug_level= -DDEBUG_ESP_HWDT
connect.menu.lvl.HWDT_NOEXTRA4K=HWDT_NOEXTRA4K
connect.menu.lvl.HWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_HWDT_NOEXTRA4K
connect.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
connect.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
connect.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
connect.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
connect.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
connect.menu.lvl.COREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
connect.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS
connect.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNS.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS
connect.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT
connect.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT
connect.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM+MDNS+HWDT_NOEXTRA4K
connect.menu.lvl.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOMMDNSHWDT_NOEXTRA4K.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM -DDEBUG_ESP_MDNS -DDEBUG_ESP_HWDT_NOEXTRA4K
connect.menu.lvl.NoAssert-NDEBUG=NoAssert-NDEBUG
connect.menu.lvl.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
connect.menu.wipe.none=Only Sketch
connect.menu.wipe.none.upload.erase_cmd=
connect.menu.wipe.sdk=Sketch + WiFi Settings
connect.menu.wipe.sdk.upload.erase_cmd=erase_region "{build.rfcal_addr}" 0x4000
connect.menu.wipe.all=All Flash Contents
connect.menu.wipe.all.upload.erase_cmd=erase_flash
connect.menu.baud.115200=115200
connect.menu.baud.115200.upload.speed=115200
connect.menu.baud.57600=57600
connect.menu.baud.57600.upload.speed=57600
connect.menu.baud.230400.linux=230400
connect.menu.baud.230400.macosx=230400
connect.menu.baud.230400.upload.speed=230400
connect.menu.baud.256000.windows=256000
connect.menu.baud.256000.upload.speed=256000
connect.menu.baud.460800.linux=460800
connect.menu.baud.460800.macosx=460800
connect.menu.baud.460800.upload.speed=460800
connect.menu.baud.512000.windows=512000
connect.menu.baud.512000.upload.speed=512000
connect.menu.baud.921600=921600
connect.menu.baud.921600.upload.speed=921600
connect.menu.baud.3000000=3000000
connect.menu.baud.3000000.upload.speed=3000000
